ТестоваяКонфигурация1/src/Catalogs/КодыРасчетногоСчета/КодыРасчетногоСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КодыРасчетногоСчета</name>
  <tabularSections>
    <name>КодыВторогоПорядка</name>
    <attributes>
      <name>КодВторогоПорядка</name>
      <comment>третья и четвертая цифры в расчетном счете</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ТестоваяКонфигурация1/src/CommonForms/ФормаДляПроверкиБанковскогоСчета/Module.bsl
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗаполнитьПолеРасчетногоСчета(Команда)
	РасчетныйСчет = СгенерироватьСлучайныйРасчетныйСчет();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Генерирует случайный расчетный счет из групп: ААА ББ ВВВ Г ДДДД ЕЕЕЕЕЕЕ,  
// где ААА задается из справочника КодыРасчетногоСчета,
// ББ из ТабличнойЧасти справочника КодыРасчетногоСчета,
// ВВВ из справочника КодыВалютДляРачетногоСчета,
// Г, ДДДД, ЕЕЕЕЕЕЕ - случайные числа согласно разрядам.
// 
// Возвращаемое значение:
//  Число - случайный расчетный счет
&НаСервере
Функция СгенерироватьСлучайныйРасчетныйСчет()
	//TODO: Проверки пустоты ссылки,  массивов
	ВыборкаААА = ПростыеЗапросы.ПолучитьВыборку("ВЫБРАТЬ Справочник.КодыРасчетногоСчета.Код");
	КодыААА = Простыезапросы.ВМассивПоКолонке(ВыборкаААА, ВыборкаААА.Код);
	ААА = РандомайзерВызовСервера.ПолучитьСлучайныйЭлементИзМассива(КодыААА);
	
	ТекстЗапросаНаСсылкуТЧ = "ВЫБРАТЬ Ссылка ИЗ Справочник.КодыРасчетногоСчета ГДЕ Код=&Код";
	ВыборкаССылкойТЧ = ПростыеЗапросы.ПолучитьВыборку(ТекстЗапросаНаСсылкуТЧ, "Код", ААА);
	Ссылка = ПростыеЗапросы.ВМассивПоКолонке(ВыборкаССылкойТЧ, ВыборкаССылкойТЧ.Ссылка)[0];
	ТекстЗапросаНаББ = "
	|ВЫБРАТЬ КодВторогоПорядка
	|ИЗ Справочник.КодыРасчетногоСчета.КодыВторогоПорядка
	|ГДЕ Ссылка=&Ссылка";
	ВыборкаББ = ПростыеЗапросы.ПолучитьВыборку(ТекстЗапросаНаББ, "Ссылка", Ссылка);
	КодыББ = ПростыеЗапросы.ВМассивПоКолонке(ВыборкаББ, ВыборкаББ.КодВторогоПорядка);
	ББ = РандомайзерВызовСервера.ПолучитьСлучайныйЭлементИзМассива(КодыББ);
	
	ВыборкаВВВ = ПростыеЗапросы.ПолучитьВыборку("ВЫБРАТЬ Справочник.КодыВалютДляРасчетныхСчетов.Код");
	КодыВВВ = Простыезапросы.ВМассивПоКолонке(ВыборкаВВВ, ВыборкаВВВ.Код);
	ВВВ = РандомайзерВызовСервера.ПолучитьСлучайныйЭлементИзМассива(КодыВВВ);

	Г = РандомайзерВызовСервера.ПолучитьСлучайноеЧисло(0, 9);
	ДДДД = РандомайзерВызовСервера.ПолучитьСлучайноеЧисло(0, 9999);
	ЕЕЕЕЕЕЕ = РандомайзерВызовСервера.ПолучитьСлучайноеЧисло(0, 9999999);

	ББ = Формат(ББ, "ЧЦ=2; ЧВН=; ЧГ=0");
	ДДДД = 	Формат(ДДДД, "ЧЦ=4; ЧВН=; ЧГ=0");
	ЕЕЕЕЕЕЕ = Формат(ЕЕЕЕЕЕЕ, "ЧЦ=7; ЧВН=; ЧГ=0");
	Результат = СтрШаблон("%1%2%3%4%5%6", ААА, ББ, ВВВ, Г, ДДДД, ЕЕЕЕЕЕЕ);
    Возврат Число(Результат);
КонецФункции
#КонецОбласти
